tutorials/simpleFoam/airFoil2D/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p GAMG
    {
        tolerance        1e-6;
        relTol           0.1;

        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;

        cacheAgglomeration true;

        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    };

    U smoothSolver
    {
        smoother         GaussSeidel;
        nSweeps          2;
        tolerance        1e-8;
        relTol           0.1;
    };

    nuTilda smoothSolver
    {
        smoother         GaussSeidel;
        nSweeps          2;
        tolerance        1e-8;
        relTol           0.1;
    };
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell 0;
    pRefValue 0;
}

relaxationFactors
{
    p               0.3;
    U               0.7;
    nuTilda         0.7;
}

// ************************************************************************* //
